RT-Thread/rt-thread/bsp/stm32/libraries/STM32WLxx_HAL/STM32WLxx_HAL_Driver/Src/stm32wlxx_hal_pwr_ex.c
/****************************************************************************/

/**
  * @brief Enable Internal Wake-up Line.
  * @retval None
  */
void HAL_PWREx_EnableInternalWakeUpLine(void)
{
#ifdef CORE_CM0PLUS
  SET_BIT(PWR->C2CR3, PWR_C2CR3_EIWUL);
#else
  SET_BIT(PWR->CR3, PWR_CR3_EIWUL);
#endif
}

/**
  * @brief Disable Internal Wake-up Line.
  * @retval None
  */
void HAL_PWREx_DisableInternalWakeUpLine(void)
{
#ifdef CORE_CM0PLUS
  CLEAR_BIT(PWR->CR3, PWR_C2CR3_EIWUL);
#else
  CLEAR_BIT(PWR->CR3, PWR_CR3_EIWUL);
#endif
}

/**
  * @brief  Set radio busy trigger polarity.
  * @param  RadioBusyPolarity This parameter can be one of the following values:
  *         @arg @ref PWR_RADIO_BUSY_POLARITY_RISING
  *         @arg @ref PWR_RADIO_BUSY_POLARITY_FALLING
  * @retval HAL Status
  */
void HAL_PWREx_SetRadioBusyPolarity(uint32_t RadioBusyPolarity)
{
  /* Check the parameters */
  assert_param(IS_RADIO_BUSY_POLARITY(RadioBusyPolarity));

  LL_PWR_SetRadioBusyPolarity(RadioBusyPolarity);
}

/**
  * @brief  Set radio busy trigger action: wake-up from low-power mode Standby,
  *         interruption.
  * @note   Signal polarity can be configured using function
  *         @ref HAL_PWREx_SetRadioBusyPolarity().
  * @param  RadioBusyTrigger This parameter can be one of the following values:
  *         @arg @ref PWR_RADIO_BUSY_TRIGGER_NONE
  *         @arg @ref PWR_RADIO_BUSY_TRIGGER_WU_IT
  * @retval None
  */
void HAL_PWREx_SetRadioBusyTrigger(uint32_t RadioBusyTrigger)
{
  /* Check the parameters */
  assert_param(IS_PWR_RADIO_BUSY_TRIGGER(RadioBusyTrigger));

#ifdef CORE_CM0PLUS
  LL_C2_PWR_SetRadioBusyTrigger(RadioBusyTrigger);
#else
  LL_PWR_SetRadioBusyTrigger(RadioBusyTrigger);
#endif
}

/**
  * @brief  Set radio IRQ trigger action: wake-up from low-power mode Standby,
  *         interruption.
  * @param  RadioIRQTrigger This parameter can be one of the following values:
  *         @arg @ref PWR_RADIO_IRQ_TRIGGER_NONE
  *         @arg @ref PWR_RADIO_IRQ_TRIGGER_WU_IT
  * @retval None
  */
void HAL_PWREx_SetRadioIRQTrigger(uint32_t RadioIRQTrigger)
{
  /* Check the parameters */
  assert_param(IS_RADIO_IRQ_TRIGGER(RadioIRQTrigger));

#ifdef CORE_CM0PLUS
  LL_C2_PWR_SetRadioIRQTrigger(RadioIRQTrigger);
#else
  LL_PWR_SetRadioIRQTrigger(RadioIRQTrigger);
#endif
}

#if defined(DUAL_CORE)
/**
  * @brief Enable CPU2 on-Hold interrupt.
  * @retval None
  */
void HAL_PWREx_EnableHOLDC2IT(void)
{
  SET_BIT(PWR->CR3, PWR_CR3_EC2H);
}

/**
  * @brief Disable CPU2 on-Hold interrupt.
  * @retval None
  */
void HAL_PWREx_DisableHOLDC2IT(void)
{
  CLEAR_BIT(PWR->CR3, PWR_CR3_EC2H);
}
#endif

/****************************************************************************/

/**
  * @brief Enable GPIO pull-up state in Standby and Shutdown modes.
  * @note  Set the relevant PUy bits of PWR_PUCRx register to configure the I/O in
  *        pull-up state in Standby and Shutdown modes.
  * @note  This state is effective in Standby and Shutdown modes only if APC bit
  *        is set through HAL_PWREx_EnablePullUpPullDownConfig() API.
  * @note  The configuration is lost when exiting the Shutdown mode due to the
  *        power-on reset, maintained when exiting the Standby mode.
  * @note  To avoid any conflict at Standby and Shutdown modes exits, the corresponding
  *        PDy bit of PWR_PDCRx register is cleared unless it is reserved.
  * @note  Even if a PUy bit to set is reserved, the other PUy bits entered as input
  *        parameter at the same time are set.
  * @param GPIO Specify the IO port. This parameter can be PWR_GPIO_A, ..., PWR_GPIO_H
  *         to select the GPIO peripheral.
  * @param GPIONumber Specify the I/O pins numbers.
  *         This parameter can be one of the following values:
  *         PWR_GPIO_BIT_0, ..., PWR_GPIO_BIT_15 (except for PORTH where less
  *         I/O pins are available) or the logical OR of several of them to set
  *         several bits for a given port in a single API call.
  * @retval HAL Status
  */
HAL_StatusTypeDef HAL_PWREx_EnableGPIOPullUp(uint32_t GPIO, uint32_t GPIONumber)
{
  HAL_StatusTypeDef status = HAL_OK;

  assert_param(IS_PWR_GPIO(GPIO));
  assert_param(IS_PWR_GPIO_BIT_NUMBER(GPIONumber));

  switch (GPIO)
  {
    case PWR_GPIO_A:
      SET_BIT(PWR->PUCRA, GPIONumber);
      CLEAR_BIT(PWR->PDCRA, GPIONumber);
      break;
    case PWR_GPIO_B:
      SET_BIT(PWR->PUCRB, GPIONumber);
      CLEAR_BIT(PWR->PDCRB, GPIONumber);
      break;
    case PWR_GPIO_C:
      SET_BIT(PWR->PUCRC, (GPIONumber & PWR_PORTC_AVAILABLE_PINS));
      CLEAR_BIT(PWR->PDCRC, (GPIONumber & PWR_PORTC_AVAILABLE_PINS));
      break;
    case PWR_GPIO_H:
      SET_BIT(PWR->PUCRH, (GPIONumber & PWR_PORTH_AVAILABLE_PINS));
      CLEAR_BIT(PWR->PDCRH, (GPIONumber & PWR_PORTH_AVAILABLE_PINS));
      break;
    default:
      status = HAL_ERROR;
      break;
  }

  return status;
}

/**
  * @brief Disable GPIO pull-up state in Standby mode and Shutdown modes.
  * @note  Reset the relevant PUy bits of PWR_PUCRx register used to configure the I/O
  *        in pull-up state in Standby and Shutdown modes.
  * @note  Even if a PUy bit to reset is reserved, the other PUy bits entered as input
  *        parameter at the same time are reset.
  * @param GPIO Specifies the IO port. This parameter can be PWR_GPIO_A, ..., PWR_GPIO_H
  *         to select the GPIO peripheral.
  * @param GPIONumber Specify the I/O pins numbers.
  *         This parameter can be one of the following values:
  *         PWR_GPIO_BIT_0, ..., PWR_GPIO_BIT_15 (except for PORTH where less
  *         I/O pins are available) or the logical OR of several of them to reset
  *         several bits for a given port in a single API call.
  * @retval HAL Status
  */
HAL_StatusTypeDef HAL_PWREx_DisableGPIOPullUp(uint32_t GPIO, uint32_t GPIONumber)
{
  HAL_StatusTypeDef status = HAL_OK;

  assert_param(IS_PWR_GPIO(GPIO));
  assert_param(IS_PWR_GPIO_BIT_NUMBER(GPIONumber));

  switch (GPIO)
  {
    case PWR_GPIO_A:
      CLEAR_BIT(PWR->PUCRA, GPIONumber);
      break;
    case PWR_GPIO_B:
      CLEAR_BIT(PWR->PUCRB, GPIONumber);
      break;
    case PWR_GPIO_C:
      CLEAR_BIT(PWR->PUCRC, (GPIONumber & PWR_PORTC_AVAILABLE_PINS));
      break;
    case PWR_GPIO_H:
      CLEAR_BIT(PWR->PUCRH, (GPIONumber & PWR_PORTH_AVAILABLE_PINS));
      break;
    default:
      status = HAL_ERROR;
      break;
  }

